<a href="https://colab.research.google.com/github/kamnsv/datawagon2/blob/main/DataWagon_2_3_WagonWizards.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Окружение

In [3]:
#@title Импорт библиотек
import os
import pyarrow.parquet as pq
import pandas as pd

# Датасет

In [1]:
#@title Параметры
PATH = 'train_1'

## Вывод статистики

In [14]:
 def table_state(name):
        print(name)
        data = pd.read_parquet(PATH + os.sep + f'{name}.parquet')
        inf=("Фича", "тип", "Пустых","НЕпустые", "Уникальных", "min", "max", "Пример")
        table = pd.DataFrame(columns=inf)
        count = len(data)
        for i, col in enumerate(data):
          na = data[col].isna().sum() # кол-во пустых
          name = f'{i+1} {col}, {data[col].dtypes}'      # единицы из группы
          row = {
                "Фича":        col,
                "тип":         data[col].dtypes,
                "Пустых":      na,
                "НЕпустые":    count - na,
                "Уникальных":  data[col].nunique(),
                "min":         '' if 'object' ==  data[col].dtypes else data[col].min(),
                "max":         '' if 'object' ==  data[col].dtypes else data[col].max(),
                "Пример":      data[col].unique()[:5],
          }
          table = pd.concat([table, pd.DataFrame([row])], ignore_index=True)
        pd.set_option('display.max_rows',  count)
        return table, data

In [8]:
[x for x in os.listdir(path) if x.endswith('.parquet')]

['dislok_wagons.parquet',
 'freight_info.parquet',
 'kti_izm.parquet',
 'pr_rems.parquet',
 'stations.parquet',
 'tr_rems.parquet',
 'wagons_probeg_ownersip.parquet',
 'wag_params.parquet']

In [15]:
table, dislok_wagons = table_state('dislok_wagons')
table

dislok_wagons

C:\Users\Alice\AppData\Local\Temp\ipykernel_788\4286995726.py:20: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  table = pd.concat([table, pd.DataFrame([row])], ignore_index=True)

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,plan_date,datetime64[us],0,6250933,184,2022-08-01 00:00:00,2023-01-31 00:00:00,"[2022-08-01 00:00:00, 2022-08-02 00:00:00, 202..."
1,wagnum,int64,0,6250933,33977,0,33976,"[1071, 1072, 834, 835, 3205]"
2,date_kap,datetime64[us],2755031,3495902,4322,2005-04-07 00:00:00,2022-08-14 00:00:00,"[NaT, 2020-06-29 00:00:00, 2022-03-16 00:00:00..."
3,date_dep,datetime64[us],351873,5899060,2047,2013-07-20 00:00:00,2022-08-14 00:00:00,"[2020-02-16 00:00:00, 2019-12-29 00:00:00, 202..."
4,kod_vrab,int64,0,6250933,3,0,2,"[0, 1, 2]"
5,date_pl_rem,datetime64[us],0,6250933,1376,2016-06-01 00:00:00,2026-12-14 00:00:00,"[2023-02-16 00:00:00, 2022-12-29 00:00:00, 202..."
6,id_road_disl,int64,0,6250933,32,0,45,"[42, 0, 29, 25, 26]"
7,st_id_dest,int64,0,6250933,2448,0,16011,"[22, 11663, 11666, 11470, 15788]"
8,id_road_dest,int64,0,6250933,32,0,45,"[42, 0, 26, 25, 30]"
9,st_id_send,int64,0,6250933,2559,3,16011,"[11470, 11661, 11662, 11666, 12604]"
10,id_road_send,int64,0,6250933,33,0,45,"[42, 0, 16, 26, 25]"
11,ost_prob,Int64,257315,5993618,241360,-48906,500000,"[36899, 36711, 35998, 34850, 34595]"
12,isload,Int64,0,6250933,2,0,1,"[0, 1]"
13,fr_id,int64,0,6250933,921,0,5073,"[5032, 1204, 0, 2255, 430]"
14,last_fr_id,int64,0,6250933,836,0,5073,"[1413, 1204, 0, 430, 1023]"
15,distance,float64,0,6250933,9482,-1.0,10387.0,"[-1.0, 998.0, 989.0, 939.0, 963.0]"

In [16]:
table, freight_info = table_state('freight_info')
table

freight_info

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,fr_id,int64,0,5079,5079,1,5086,"[4989, 4990, 4991, 4992, 4993]"
1,fr_class,int64,0,5079,4,0,3,"[2, 0, 1, 3]"
2,skoroport,int64,0,5079,2,0,1,"[0, 1]"
3,naval,int64,0,5079,2,0,1,"[0, 1]"
4,nasip,int64,0,5079,2,0,1,"[0, 1]"
5,naliv,int64,0,5079,2,0,1,"[0, 1]"
6,openvagons,int64,0,5079,2,0,1,"[0, 1]"
7,soprovod,int64,0,5079,2,0,1,"[0, 1]"
8,smerz,int64,0,5079,2,0,1,"[0, 1]"

In [17]:
table, kti_izm = table_state('kti_izm')
table

kti_izm

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,wagnum,int64,0,22428,6686,0,33975,"[1302, 1374, 2916, 3849, 4494]"
1,operation_date_dttm,object,0,22428,28,,,"[2023-02-17, 2023-02-25, 2023-02-21, 2023-02-1..."
2,mileage_all,float64,273,22155,20053,1.0,497856.0,"[67638.0, 83798.0, 121660.0, 59664.0, 7306.0]"
3,axl1_l_w_flange,float64,12,22416,103,23.5,34.0,"[29.6, 29.1, 30.4, 30.6, 30.9]"
4,axl1_r_w_flange,float64,19,22409,105,23.4,34.0,"[29.5, 27.9, 26.5, 29.2, 28.7]"
5,axl2_l_w_flange,float64,16,22412,103,23.7,34.0,"[30.0, 27.7, 30.8, 31.6, 32.4]"
6,axl2_r_w_flange,float64,20,22408,102,23.8,34.0,"[29.6, 29.1, 28.2, 28.5, 28.1]"
7,axl3_l_w_flange,float64,17,22411,102,23.9,34.0,"[30.2, 29.3, 26.9, 31.0, 31.2]"
8,axl3_r_w_flange,float64,21,22407,105,21.8,34.0,"[29.9, 30.2, 27.1, 30.7, 29.7]"
9,axl4_l_w_flange,float64,15,22413,105,23.4,33.9,"[30.9, 29.4, 29.8, 29.3, 30.5]"
10,axl4_r_w_flange,float64,12,22416,102,23.8,34.0,"[29.5, 27.5, 31.2, 30.0, 29.9]"
11,axl1_l_w_rim,float64,141,22287,537,25.2,79.9,"[37.8, 48.9, 69.2, 75.1, 75.6]"
12,axl1_r_w_rim,float64,132,22296,544,22.8,80.0,"[39.2, 49.0, 66.7, 76.1, 76.8]"
13,axl2_l_w_rim,float64,135,22293,550,23.8,80.3,"[39.5, 49.7, 66.8, 74.8, 74.1]"
14,axl2_r_w_rim,float64,136,22292,548,23.3,80.1,"[38.9, 51.0, 63.7, 73.7, 74.7]"
15,axl3_l_w_rim,float64,177,22251,547,25.3,80.2,"[41.8, 30.7, 66.1, 75.6, 75.8]"
16,axl3_r_w_rim,float64,155,22273,546,23.6,79.9,"[38.9, 32.4, 66.3, 76.8, 77.0]"
17,axl4_l_w_rim,float64,122,22306,546,24.8,80.7,"[36.5, 30.6, 68.1, 72.2, 74.9]"
18,axl4_r_w_rim,float64,110,22318,547,23.5,79.9,"[38.2, 28.8, 67.6, 72.9, 74.2]"

In [18]:
table, pr_rems = table_state('pr_rems')
table

pr_rems

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,wagnum,int64,0,10441,10393,12,33976,"[15000, 25485, 25944, 24080, 28612]"
1,rem_month,datetime64[us],0,10441,183,2022-08-02 00:00:00,2023-01-31 00:00:00,"[2022-08-05 00:00:00, 2022-08-21 00:00:00, 202..."
2,rod_id,int64,0,10441,2,0,1,"[1, 0]"
3,model,string[python],0,10441,39,11-1807,12-9850-02,"[12-132, 12-132-03, 12-296-01, 12-1303-01, 11-..."
4,road_id_send,int64,0,10441,18,3,47,"[3, 13, 6, 19, 5]"
5,road_id_rem,int64,0,10441,18,3,47,"[3, 13, 7, 6, 19]"
6,kod_vrab,int64,0,10441,2,0,1,"[0, 1]"
7,st_id_send,int64,0,10441,911,23,16008,"[493, 6152, 4711, 4799, 5919]"
8,st_id_rem,int64,0,10441,415,23,13043,"[493, 4793, 3940, 420, 10375]"
9,distance,float64,0,10441,2028,0.0,6642.0,"[37.0, 360.0, 322.0, 308.0, 373.0]"
10,month,int64,0,10441,6,1,12,"[8, 9, 10, 11, 12]"

In [19]:
table, stations = table_state('stations')
table

stations

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,st_id,int64,0,148032,16160,23,16700,"[13069, 9353, 9973, 13745, 14554]"
1,road_id,int64,0,148032,23,3,52,"[47, 18, 19, 6, 15]"
2,st_border_sign,string[python],0,148032,2,0,1,"[0, 1]"
3,st_sea_sign,string[python],0,148032,2,0,1,"[0, 1]"
4,st_river_sign,string[python],0,148032,2,0,1,"[0, 1]"
5,st_car_sign,string[python],0,148032,2,0,1,"[0, 1]"
6,st_ferry_sign,string[python],0,148032,2,0,1,"[0, 1]"
7,st_freigh_sign,string[python],0,148032,2,0,1,"[0, 1]"
8,opor_station_sign,string[python],0,148032,2,0,1,"[0, 1]"

In [20]:
table, tr_rems = table_state('tr_rems')
table

tr_rems

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,wagnum,int64,0,48652,17849,0,33976,"[29938, 29852, 13674, 1145, 2430]"
1,rem_month,datetime64[us],0,48652,6,2022-08-01 00:00:00,2023-01-01 00:00:00,"[2022-08-01 00:00:00, 2022-09-01 00:00:00, 202..."
2,kod_vrab,int64,0,48652,3,2,5,"[3, 2, 5]"
3,neis1_kod,int64,0,48652,120,0,132,"[0, 14, 36, 95, 2]"
4,neis2_kod,int64,0,48652,88,0,98,"[98, 97, 95, 62, 2]"
5,neis3_kod,int64,0,48652,45,0,54,"[54, 51, 0, 52, 13]"
6,mod1_kod,int64,0,48652,8,0,7,"[7, 4, 1, 6, 2]"
7,mod2_kod,int64,0,48652,5,0,4,"[4, 3, 1, 0, 2]"
8,mod3_kod,int64,0,48652,3,0,2,"[2, 1, 0]"
9,mod4_kod,int32,0,48652,1,0,0,[0]
10,mod5_kod,int32,0,48652,1,0,0,[0]
11,mod6_kod,int32,0,48652,1,0,0,[0]
12,mod7_kod,int32,0,48652,1,0,0,[0]
13,road_id_send,int64,0,48652,25,3,44,"[38, 28, 3, 25, 40]"
14,gr_probeg,Int64,732,47920,21293,7,308120,"[87913, 81824, 64130, 89735, 68986]"
15,por_probeg,Int64,675,47977,22873,1,207343,"[37467, 45579, 34697, 39549, 26528]"
16,st_id_send,int64,0,48652,709,22,15990,"[10522, 10441, 4789, 392, 5380]"

In [21]:
table, wagons_probeg_ownersip = table_state('wagons_probeg_ownersip')
table

wagons_probeg_ownersip

C:\Users\Alice\AppData\Local\Temp\ipykernel_788\4286995726.py:20: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  table = pd.concat([table, pd.DataFrame([row])], ignore_index=True)

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,repdate,datetime64[us],0,6249857,184,2022-08-01 00:00:00,2023-01-31 00:00:00,"[2022-08-01 00:00:00, 2022-08-02 00:00:00, 202..."
1,wagnum,int64,0,6249857,33977,0,33976,"[33361, 33364, 33366, 33358, 33349]"
2,ost_prob,Int64,256959,5992898,241360,-48906,500000,"[7541, 7243, 6990, 6347, 6027]"
3,manage_type,int64,0,6249857,2,0,1,"[0, 1]"
4,rod_id,int64,0,6249857,2,0,1,"[1, 0]"
5,reestr_state,int64,0,6249857,3,0,2,"[1, 2, 0]"
6,ownership_type,int64,0,6249857,1,0,0,[0]
7,month,int64,0,6249857,6,1,12,"[8, 9, 10, 11, 12]"

In [22]:
table, wag_params = table_state('wag_params')
table

wag_params

,Фича,тип,Пустых,НЕпустые,Уникальных,min,max,Пример
0,wagnum,int64,0,33977,33977,0,33976,"[26318, 28344, 8099, 33350, 5308]"
1,model,string[python],0,33977,50,11-066-04,Р-9494-01,"[12-600-04, 12-132, 11-286, 12-9850-02, 11-276]"
2,rod_id,int64,0,33977,2,0,1,"[1, 0]"
3,gruz,Int64,0,33977,17,660,750,"[682, 700, 670, 750, 680]"
4,cnsi_gruz_capacity,Int64,0,33977,17,660,750,"[682, 700, 670, 750, 680]"
5,cnsi_volumek,Float64,0,33977,22,73.0,174.0,"[85.0, 88.0, 138.0, 90.0, 122.0]"
6,tara,Int64,0,33977,56,217,273,"[240, 270, 248, 260, 250]"
7,date_build,datetime64[ms],0,33977,8637,1985-04-12 00:00:00,2024-11-29 00:00:00,"[1992-12-25 00:00:00, 2003-08-12 00:00:00, 199..."
8,srok_sl,datetime64[ms],0,33977,9119,2017-12-11 00:00:00,2056-11-20 00:00:00,"[2022-04-27 00:00:00, 2024-12-24 00:00:00, 202..."
9,zavod_build,int64,0,33977,24,0,23,"[5, 0, 1, 19, 17]"
10,date_iskl,datetime64[ms],33861,116,30,2019-05-17 00:00:00,2023-09-18 00:00:00,"[2023-02-16 00:00:00, 2022-12-14 00:00:00, NaT..."
11,cnsi_probeg_dr,Int64,0,33977,5,110,350,"[160, 110, 250, 350, 320]"
12,cnsi_probeg_kr,Int64,0,33977,4,0,500,"[160, 500, 0, 320]"
13,kuzov,Int64,0,33977,4,1,43,"[2, 22, 43, 1]"
14,telega,Int64,0,33977,4,2,27,"[9, 11, 2, 27]"
15,tormoz,Int64,0,33977,3,1,3,"[3, 2, 1]"
16,tipvozd,string[python],0,33977,12,1,9,"[6, 1, 7, 4, 3]"
17,tippogl,Int64,59,33918,17,1,21,"[11, 12, 1, 2, 6]"
18,norma_km,Int64,0,33977,8,0,500000,"[110000, 0, 160000, 250000, 350000]"
19,ownertype,int64,0,33977,2,0,1,"[0, 1]"

## Оценка метрики

In [4]:
from train_1.metrics_f1 import calc_f1_score

target = pd.read_csv(PATH + os.sep + 'target/y_train.csv').convert_dtypes()

# подготовка презсказания. Нужно убрать, когда будут другие данные.
pred_target = target[['wagnum']]                               # номера вагонов для предсказания взяты из имеющегося файла
month_to_predict = pd.to_datetime('2022-12-01')       # дата предсказания
pred_target['current_date'] = month_to_predict                 # месяц, на который нужно предсказание
pred_target['target_month'] = 1                                # заполняю одним числом
pred_target['target_day'] = pred_target['target_month']                 # заполняю тем же числом
target_path = PATH + os.sep + 'prediction/target_predicton.csv'
pred_target.drop_duplicates(subset = 'wagnum').to_csv(target_path, index=False)

# таргет по прогноза выбытия вагонов в ПР на месяц и на 10 дней
true_target_path = PATH + os.sep + 'prediction/target_predicton_true.csv'
target.drop_duplicates(subset = 'wagnum').to_csv(true_target_path, index=False)

# оценим насколько хорошо удалось предсказать выбытие вагонов  по месяцу и по 10 дням
calc_f1_score( true_target_path, target_path,)

C:\Users\Alice\AppData\Local\Temp\ipykernel_7076\1427595871.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pred_target['current_date'] = month_to_predict                 # месяц, на который нужно предсказание
C:\Users\Alice\AppData\Local\Temp\ipykernel_7076\1427595871.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pred_target['target_month'] = 1                                # заполняю одним числом

0.06047522451698957